Config/DataProcessors/FillRoomPropertiesWizard.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>FillRoomPropertiesWizard</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Rooms</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Room</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Rooms</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>RoomProperties</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>RoomProperty</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.RoomProperties</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/InformationRegisters/RoomProperties.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>RoomProperties</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ChangeDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Room</Name>
					<Comment>Номер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Rooms</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RoomProperty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomProperties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/DataProcessors/FillRoomPropertiesWizard/Ext/ObjectModule.bsl
// -----------------------------------------------------------------------------
Procedure pmExecute() Export
	If RoomProperties.Count() > 0 Then
		For Each vRow In RoomProperties Do
			If ValueIsFilled(vRow.RoomProperty) Then
				// Remove property from all rooms
				vProps = InformationRegisters.RoomProperties.CreateRecordSet();
				vProps.Filter.RoomProperty.Set(vRow.RoomProperty);
				vProps.Clear();
				vProps.Write(True);

				For Each vRoomsRow In Rooms Do
					If ValueIsFilled(vRoomsRow.Room) Then
						vPropsRec = vProps.Add();
						vPropsRec.Room = vRoomsRow.Room;
						vPropsRec.RoomProperty = vRow.RoomProperty;
						vPropsRec.Remarks = vRow.RoomProperty.Remarks;
						vPropsRec.Author = SessionParameters.CurrentUser;
					EndIf;
				EndDo;
				vProps.Write(True);
			EndIf;
		EndDo;
	Else
		For Each vRoomsRow In Rooms Do
			If ValueIsFilled(vRoomsRow.Room) Then
				vProps = InformationRegisters.RoomProperties.CreateRecordSet();
				vProps.Filter.Room.Set(vRoomsRow.Room);
				vProps.Clear();
				vProps.Write(True);
			EndIf;
		EndDo;
	EndIf;
EndProcedure // pmExecute
